content-org/all-posts.org
#+hugo_base_dir: ../
#+macro: abbr @@html:<abbr title="$2">$1</abbr>@@
#+macro: dfn @@html:<dfn>$1</dfn>@@
#+macro: var @@html:<var>$1</var>@@
#+macro: q @@html:<q cite="$1">$2</q>@@
#+macro: person @@html:<span class="person p-name">$1</span>@@
#+macro: lang @@html:<span class="language">$1</span>@@

*** DONE Moving in Rust is Pure     :opinion:rust:programming:functional_programming:
CLOSED: [2023-04-09 Mon 10:44]
:PROPERTIES:
:EXPORT_FILE_NAME: moving_is_pure
:END:
**** Intro
The act of moving arguments within {{{lang(Rust)}}}'s functions serves as a compelling means to uphold the /purity/ of the function. By embracing this practice, we ensure that the function operates on unique ownership of its inputs, preserving the integrity and /immutability/ of data, which are fundamental tenets of /functional programming/.
**** Moving a Variable to a Function in {{{lang(Rust)}}} Doesn't Make It Impure
So as an introduction, if you don't know {{{lang(Rust)}}}.

In {{{lang(Rust)}}}, we have this concept of /moving/ variables. It is like this:

#+begin_src rust
    //  A variable is made.
    let a_variable = some_value;

    // It moves into this function.
    _ = a_function_that_takes_ownership(a_variable);

    // We cannot use a_variable anymore! So, we cannot do this!
    let b_variable = a_variable;
#+end_src

Now I consider =a_function_that_takes_ownership= to be a /pure function/. However, it raises a possible confusion:

#+begin_quote
Doesn't a_function_that_takes_ownership change the state of the outer function? Isn't that a side effect?
#+end_quote

I argue that it doesn't. Here is why: a function is not a function call. Ok. let's visualize it.

#+begin_example
      ________outer_function_______
--in->|       __inner_f___        |-out->
      | -in-> |          | -out-> |
      |       ------------        |
      -----------------------------
#+end_example

So we have two functions. One outer, and one inner.

- Each function should have inputs and an output.
- Other than their outputs, they should not change anything outside their function space.

If these conditions are not met, our function is not /pure/.


***** Step 1
Now consider a variable =[V]=.

#+begin_example
      _____________________________
----->| [v]   ____________        |----->
      | ----> |          | -----> |
      |       ------------        |
      -----------------------------
#+end_example


***** Step 2
With our outer function, we create a function call for the inner function.

#+begin_example
      _____________________________
----->|       ____________        |----->
      | [v]-> |          | -----> |
      |       ------------        |
      -----------------------------
#+end_example


***** Step 3
It is no longer in the state space of the outer function. The inner function takes /ownership/ of it.

#+begin_example
      _____________________________
----->|       ____________        |----->
      | ----> |   [v]    | -----> |
      |       ------------        |
      -----------------------------
#+end_example

Semantically, for the outer function =[v]= was used in the function call and then dropped. Which does not violate our rules. For the inner function, it just got an input and returns an output. So it makes sematic sense.

In practice, it also makes the same guarantees as any other /pure function/: - No null pointers. - No /mutable state/. - No /side effects/.

If the caller =.clone()= our value and make a copy of it and pass that to the inner function, it provides us with no other guarantees, other than more memory usage and slightly longer code.

**** Why does it matter?
Well, Honestly, it doesn't. I just had to decide if in a /pure function/ I can consume a self, if I want to make it a /pure function/, considering that I cannot make it /const/. This was my thinking output. Now you are the outer function.
